{"config": [{"config": {"strides": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 30, 30, 1], "kernel_constraint": null, "trainable": true, "padding": "valid", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "padding": "valid", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "units": 128, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "units": 128, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "units": 32, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4"}