{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 30, 30, 1], "use_bias": true, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activation": "relu", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activation": "relu", "bias_regularizer": null, "units": 128}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activation": "relu", "bias_regularizer": null, "units": 128}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "activation": "softmax", "bias_regularizer": null, "units": 32}}], "keras_version": "2.0.4", "backend": "tensorflow"}